readme.org
#+TITLE: Mitch Kyle's Emacs 26 Configuration
#+AUTHOR: Mitch Kyle
#+EMAIL: mitch.tux@gmail.com

* What's All This Then?
  This is a configuration file for Emacs.

Inspired by [[http://aaronbedra.com/emacs.d/][Aaron Bedra's config]] with elements taken from [[https://github.com/bbatsov/prelude][prelude]].

This is a [[https://en.wikipedia.org/wiki/Literate_programming][literate program]] which sits at =~/.emacs.d/readme.org= and
compiles to =~/.emacs.d/init.el{,c}=. Recompile by running =mkyle/rebuild-init-file=.

I named this file =readme.org= so it will show up on the GitHub repo landing page and the idea of
having a literate program called "readme" amuses me slightly.

The language in this document is informal written as me the writer to you the reader (who is
probably me in the future /shout-out)

** Installation
pretty straight-forward
#+BEGIN_EXAMPLE
git clone https://github.com/mitch-kyle/emacs-config.git ~/.emacs.d
#+END_EXAMPLE

** Questions?
One of the purposes of this document is to provide information along with the configuration. It was however,
hastily written. I suspect a lot of it does not make sense. Feel free to open issues asking for clarification
or pointing out typos or nonsense and I'll try to help and improve the document as I go.

* Table Of Contents                                                   :TOC_4:
- [[#whats-all-this-then][What's All This Then?]]
  - [[#installation][Installation]]
  - [[#questions][Questions?]]
- [[#platform][Platform]]
  - [[#early-init][Early Init]]
    - [[#garbage-collection][Garbage Collection]]
    - [[#defer-filename-handlers][Defer Filename Handlers]]
    - [[#maximize-screen-space][Maximize Screen Space]]
    - [[#disable-modeline][Disable Modeline]]
    - [[#short-answers][Short Answers]]
    - [[#silence-redefinition-warnings][Silence Redefinition Warnings]]
    - [[#early-init-footer][Early Init Footer]]
  - [[#file-header][File Header]]
  - [[#package-manager---straightel][Package Manager - straight.el]]
  - [[#package-configuration---use-package][Package Configuration - use-package]]
  - [[#compiling-this-project][Compiling this Project]]
    - [[#org-early-load][Org Early Load]]
- [[#look-and-feel][Look And Feel]]
  - [[#executable-path][Executable Path]]
  - [[#manage-config-directory][Manage Config Directory]]
    - [[#no-litter][No Litter]]
    - [[#custom][Custom]]
  - [[#theme][Theme]]
    - [[#theme-hook][Theme Hook]]
    - [[#settings][Settings]]
  - [[#mode-line][Mode Line]]
    - [[#hide-minor-modes][Hide Minor Modes]]
    - [[#search-results][Search Results]]
    - [[#buffer-information][Buffer Information]]
    - [[#spaceline][Spaceline]]
  - [[#fonts][Fonts]]
    - [[#coloured-emojis][Coloured Emojis]]
  - [[#ease-of-use][Ease Of Use]]
    - [[#remove-startup-clutter][Remove Startup Clutter]]
    - [[#large-file-warning][Large File Warning]]
    - [[#disable-blinking-cursor][Disable Blinking Cursor]]
    - [[#show-keybindings][Show Keybindings]]
    - [[#open-file-at-point][Open File At Point]]
    - [[#titles][Titles]]
      - [[#set-frame-title-format][Set Frame Title Format]]
      - [[#buffer-titles][Buffer Titles]]
    - [[#reload-when-files-change][Reload When Files Change]]
    - [[#save-command-history][Save Command History]]
    - [[#splitting-windows][Splitting Windows]]
    - [[#finding-the-cursor][Finding the Cursor]]
    - [[#remove-suspend-frame-keybinding][Remove suspend-frame keybinding]]
  - [[#navigation][Navigation]]
    - [[#list-buffers---ibuffer][List Buffers - IBuffer]]
      - [[#ibuffer-columns][IBuffer Columns]]
      - [[#ibuffer-filter-groups][IBuffer Filter Groups]]
    - [[#list-options-when-doing-things---ido][List Options When Doing Things - Ido]]
    - [[#direct-based-window-navigation---windmove][Direct Based Window Navigation - Windmove]]
  - [[#editing][Editing]]
    - [[#keep-directories-clean][Keep Directories Clean]]
    - [[#project-management---projectile][Project Management - Projectile]]
      - [[#projectile-ibuffer-groups][Projectile IBuffer Groups]]
    - [[#edit-remote-files---tramp][Edit Remote Files - Tramp]]
    - [[#sane-basic-editing-keybindings][Sane Basic Editing Keybindings]]
    - [[#rainbow-delimiters][Rainbow Delimiters]]
    - [[#line-numbers][Line Numbers]]
    - [[#scrolling][Scrolling]]
    - [[#tab-behaviour][Tab Behaviour]]
    - [[#keep-whitespace-clean][Keep Whitespace Clean]]
    - [[#selecting-text][Selecting Text]]
    - [[#autocomplete-dropdown][Autocomplete Dropdown]]
    - [[#highlighting][Highlighting]]
      - [[#search-results-1][Search Results]]
      - [[#matching-delimiters---show-paren][Matching Delimiters - show-paren]]
      - [[#rainbow-mode][Rainbow Mode]]
      - [[#matching-symbols][Matching Symbols]]
    - [[#spell-checking---flyspell][Spell Checking - flyspell]]
    - [[#code-snippets---yasnippets][Code Snippets - yasnippets]]
  - [[#x-windows][X Windows]]
    - [[#window-divider][Window Divider]]
    - [[#transparency][Transparency]]
- [[#language-specific-packages][Language Specific Packages]]
  - [[#org-mode][Org Mode]]
  - [[#emacs-lisp][Emacs Lisp]]
    - [[#documentation][Documentation]]
    - [[#autocompile][Autocompile]]
  - [[#conf-files][Conf Files]]
  - [[#clojure][Clojure]]
    - [[#cider][Cider]]
  - [[#cmake][CMake]]
  - [[#javascript][JavaScript]]
  - [[#scheme][Scheme]]
  - [[#groovy][Groovy]]
  - [[#docker][Docker]]
  - [[#yaml][YAML]]
  - [[#markdown][Markdown]]
  - [[#lua][Lua]]
  - [[#zsh][Zsh]]
  - [[#terraform][Terraform]]
- [[#software-distribution-specific-packages][Software Distribution Specific Packages]]
  - [[#arch][Arch]]
  - [[#guix][Guix]]
- [[#miscellaneous-packages][Miscellaneous Packages]]
  - [[#git][Git]]
    - [[#magit][Magit]]
    - [[#git-file-modes][Git file modes]]
    - [[#mergetool][Mergetool]]
  - [[#restclient][Restclient]]
  - [[#irc][IRC]]
  - [[#persistent-scratch][Persistent Scratch]]
  - [[#terminal][Terminal]]
    - [[#vtermux][vtermux]]
  - [[#external-applications][External Applications]]
    - [[#persistent-buffers][Persistent Buffers]]
    - [[#volume][Volume]]
    - [[#music][Music]]
  - [[#window-manager---exwm][Window Manager - EXWM]]
- [[#footer][Footer]]
- [[#tasks][Tasks]]
  - [[#recompile-on-save][Recompile on save]]

* Platform
Things that inform the rest of the configuration.

** Early Init
Things we want to do before configuring package management
#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;; init.el --- emacs early initialization -*- lexical-binding: t; -*-
;;; Commentary:
;; Generated file. do not edit. changes may be overwritten
;;; Code:
#+END_SRC

*** Garbage Collection
Wait until after startup to garbage collect as per, [How does Doom start so quickly?](https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly)
#+BEGIN_SRC emacs-lisp :tangle early-init.el
(setq gc-cons-threshold  most-positive-fixnum ; 2^61 bytes
      gc-cons-percentage 0.6)
#+END_SRC

Once startup is finished, reset gc threshold to something sensible to prevent freezes
#+BEGIN_SRC emacs-lisp :tangle early-init.el
(add-hook 'emacs-startup-hook
  (lambda ()
    (setq gc-cons-threshold  33554432 ;32M
          gc-cons-percentage 0.1)))
#+END_SRC

*** Defer Filename Handlers
Prevent looking up file name handlers until after startup
#+BEGIN_SRC emacs-lisp :tangle early-init.el
(let ((saved-file-name-handler-alist file-name-handler-alist))
  (setq file-name-handler-alist nil)
  (add-hook 'emacs-startup-hook
    (lambda ()
      (setq file-name-handler-alist (append saved-file-name-handler-alist file-name-handler-alist)))))
#+END_SRC

*** Maximize Screen Space
Remove the different bars taking up valuable working space. Remove these in early init to prevent them being drawn.
#+BEGIN_SRC emacs-lisp :tangle early-init.el
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+END_SRC

*** Disable Modeline
Disable modeline until we apply our sugar later
#+BEGIN_SRC emacs-lisp :tangle early-init.el
(setq mode-line-format nil)
#+END_SRC

*** Short Answers
Use 'y' or 'n' rather than 'yes' or 'no'. This should improve productivity when answering binary questions by up
to 60% according to Homer Simpson.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

*** Silence Redefinition Warnings
Prevent warnings when advice is added to functions.
[[https://andrewjamesjohnson.com/suppressing-ad-handle-definition-warnings-in-emacs/][More Information]]
#+BEGIN_SRC emacs-lisp :tangle early-init.el
(setq ad-redefinition-action 'accept)
#+END_SRC

*** Early Init Footer
#+BEGIN_SRC emacs-lisp :tangle early-init.el
;; early-init.el ends here
#+END_SRC

** File Header
Things we want to happen immediately before loading package management and use-package
Add an emacs lisp header to the generated file with an explanation that it is a generated file
#+BEGIN_SRC emacs-lisp :tangle init.el
;;; init.el --- emacs initialization -*- lexical-binding: t; -*-
;;; Commentary:
;; Generated file. do not edit. changes may be overwritten
;;; Code:
#+END_SRC

** Package Manager - straight.el
A functional package manager for emacs. See [[https://github.com/raxod502/straight.el][straight.el github]]
#+BEGIN_SRC emacs-lisp :tangle init.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
      (url-retrieve-synchronously
       "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
       'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+END_SRC

** Package Configuration - use-package
[[https://github.com/jwiegley/use-package][use-package]] is a feature-rich package configuration tool. In the event of error during package configuration,
it doesn't prevent the rest of your configuration from loading. Set it to use straight.el by default.
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq straight-use-package-by-default t)
(straight-use-package 'use-package)
#+END_SRC

** Compiling this Project
A function to rebuild this project if it's changed since the last time it was built.
#+BEGIN_SRC emacs-lisp :tangle init.el
(with-eval-after-load "org"
  (defun mkyle/rebuild-init-file ()
    "Rebuild init files if they've changed since the last time it was built."
    (interactive)
    (org-babel-tangle-file (expand-file-name "readme.org"
                                             user-emacs-directory)
                           "emacs-lisp")
    (byte-compile-file (expand-file-name "early-init.el"
                                         user-emacs-directory))
    (byte-compile-file (expand-file-name "init.el"
                                          user-emacs-directory))
    (org-babel-tangle-file (expand-file-name "window-manager.org"
                                             user-emacs-directory)
                           "emacs-lisp")
    (byte-compile-file (expand-file-name "window-manager.el"
                                         user-emacs-directory))))
#+END_SRC

*** Org Early Load
Because straight.el can't properly compile org yet, we need to define the org-version function
ourselves to prevent the old builtin org from being loaded instead.

#+BEGIN_SRC emacs-lisp :tangle init.el :noweb yes
(use-package git)
(when (require 'git nil t)
  (defun org-git-version ()
    "The Git version of org-mode.
Inserted by installing org-mode or when a release is made."
    (let ((git-repo (expand-file-name "straight/repos/org/"
                                      user-emacs-directory)))
      (string-trim
       (git-run "describe"
                "--match=release\*"
                "--abbrev=6"
                "HEAD"))))

  (defun org-release ()
    "The release version of org-mode.
Inserted by installing org-mode or when a release is made."
    (let ((git-repo (expand-file-name "straight/repos/org/"
                                      user-emacs-directory)))
      (string-trim
       (string-remove-prefix
        "release_"
        (git-run "describe"
                 "--match=release\*"
                 "--abbrev=0"
                 "HEAD")))))

  (provide 'org-version))

<<load-org>>
#+END_SRC

* Look And Feel
