readme.org
** Executable Path
Set the path to the environment variable PATH always
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package exec-path-from-shell
  :config
  (exec-path-from-shell-initialize))
#+END_SRC

** Manage Config Directory
*** No Litter
 Keep =~/.emacs.d= clean. some libraries create variable files and/or additional configuration files
 in the emacs user directory; no-littering puts most of these files in =~/.emacs.d/var= and =~/.emacs.d/etc=
 respectively.
 #+BEGIN_SRC emacs-lisp :tangle init.el
 (use-package no-littering)
 #+END_SRC

*** Custom
Use a separate file for custom modifications so they are not overwritten in init.el
#+BEGIN_SRC emacs-lisp :tangle init.el
(with-eval-after-load "no-littering"
  (let ((base-custom-file (expand-file-name "custom" no-littering-etc-directory)))
    (setq-default custom-file (concat base-custom-file ".el"))
    (load base-custom-file t)))
#+END_SRC

Compile custom file when it changes.
#+BEGIN_SRC emacs-lisp :tangle init.el
(defadvice custom-save-all (after mkyle/recompile-custom-file-on-save () activate)
  "Recompile custom files after saving to it"
  (byte-compile-file custom-file))
 #+END_SRC

** Theme
*** Theme Hook
There's no hook that runs after a theme is enabled so lets make one.
#+BEGIN_SRC emacs-lisp :tangle init.el
(defvar mkyle/after-enable-theme-hook nil
  "Hook to run after a theme is enabled.")

(advice-add 'enable-theme :after
            (lambda (theme)
              (unless (eq theme 'user)
                (run-hooks 'mkyle/after-enable-theme-hook)))
            '((name . mkyle/after-enable-theme-hook)))
#+END_SRC

*** Settings
This is where we load the theme, it handles colors and text effects
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package monokai-theme
  :straight (monokai-theme :type git
                           :host github
                           :repo "mitch-kyle/monokai-emacs")
  :ensure t
  :config (load-theme 'monokai t))
#+END_SRC

** Mode Line
The modeline displays information about the buffer like buffer name and what modes are currently active
between the window and the minibuffer.

*** Hide Minor Modes
Mode line is for showing all the active modes. Some of these are not useful so let's hide them.
This adds the =:diminish= key to =use-package= which will hide the minor-mode associated with the package.
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package diminish :defer t)
#+END_SRC

*** Search Results
Show total number of search matches and the current match index in the modeline
See [[https://github.com/syohex/emacs-anzu][emacs-anzu]]
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package anzu
  :diminish anzu-mode
  :config (global-anzu-mode t))
#+END_SRC

*** Buffer Information
Show buffer size
#+BEGIN_SRC emacs-lisp :tangle init.el
(size-indication-mode t)
#+END_SRC

Show cursor position in buffer
#+BEGIN_SRC emacs-lisp :tangle init.el
(line-number-mode t)
(column-number-mode t)
#+END_SRC

*** Spaceline
Spaceline is a nice looking mode line package based on powerline from the
[[http://spacemacs.org/][spacemacs]] distribution
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package spaceline
  :config
  (progn
    (require 'spaceline)
    (require 'spaceline-segments)

    (setq-default anzu-cons-mode-line-p           nil
                  powerline-default-separator     'contour
                  spaceline-minor-modes-separator " ")

    ;; Projectile doesn't really fit with the other minor modes
    ;; but the menu might be useful. let's move it to it's own
    ;; segment
    (spaceline-define-segment mkyle/projectile
      "Display project name with projectile menu"
      (when (and (boundp projectile-project-root)
                 (projectile-project-root))
        (propertize (projectile-project-name)
          'local-map (let ((map (make-sparse-keymap)))
                       (define-key map [mode-line down-mouse-1]
                                   projectile-mode-menu)
                        map)
          'mouse-face 'mode-line-highlight)))


    (defun mkyle/spaceline-reset ()
      (spaceline-compile)
      (setq-default mode-line-format
                    '("%e" (:eval (spaceline-ml-main)))))

    (defun mkyle/spaceline-theme (&rest additional-segments)
      "Spaceline emacs theme with some tweaks"
      (spaceline-compile
       `((((((persp-name :fallback workspace-number) window-number)
            :separator "•")
           buffer-modified
           buffer-size)
          :face highlight-face
          :priority 100)
         (anzu :priority 95)
         auto-compile
         ((buffer-id remote-host)
          :priority 98)
         (major-mode :priority 79)
         (process :when active)
         ((flycheck-error flycheck-warning flycheck-info)
          :when active
          :priority 89)
         (minor-modes :when active
                      :priority 9)
         (mu4e-alert-segment :when active)
         (erc-track :when active)
         (version-control :when active
                          :priority 78)
         (mkyle/projectile :priority 20)
         (org-pomodoro :when active)
         (org-clock :when active)
         nyan-cat)
       `(which-function
         (python-pyvenv :fallback python-pyenv)
         (purpose :priority 94)
         (battery :when active)
         (selection-info :priority 95)
         input-method
         ((point-position line-column)
          :separator " • "
          :priority 96)
         ((buffer-encoding-abbrev)
          :priority 9)
         (global :when active)
         ,@additional-segments
         (buffer-position :priority 99)
         (hud :priority 99)))
      (setq-default mode-line-format
                    '("%e" (:eval (spaceline-ml-main)))))

    (mkyle/spaceline-theme)
    (add-hook 'mkyle/after-enable-theme-hook 'mkyle/spaceline-reset)))
#+END_SRC

** Fonts
[[http://terminus-font.sourceforge.net/][Terminus Font]] is designed for terminals and source code.
#+BEGIN_SRC emacs-lisp :tangle init.el
(when (member "Terminus" (font-family-list))
  (set-frame-font "Terminus 12" nil (frame-list)))
#+END_SRC

Add font with better unicode coverage.
#+BEGIN_SRC emacs-lisp :tangle init.el
(when (member "Symbola" (font-family-list))
  (set-fontset-font t 'unicode "Symbola" nil 'prepend))
#+END_SRC

*** Coloured Emojis
#+BEGIN_SRC emacs-lisp :tangle init.el
(when (and window-system
           (member "Noto Color Emoji" (font-family-list)))
  (set-fontset-font t 'unicode "Noto Color Emoji" nil 'prepend)

  (defvar emojify-display-style)
  (use-package emojify
    :init (setq emojify-display-style 'unicode)))
#+END_SRC

** Ease Of Use
These don't really fit anywhere else but they are essential to make emacs not feel ancient and esoteric

*** Remove Startup Clutter
The startup screen has some nice information for new users but it's in the way.
Same with the scratch buffer explanation.
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq inhibit-startup-screen  t
      initial-scratch-message nil)
#+END_SRC

*** Large File Warning
warn when opening files bigger than 100MB
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq-default large-file-warning-threshold 104857600)
#+END_SRC

*** Disable Blinking Cursor
In theory the blinking cursor could be a conservation tool; consume only half of the power of a static cursor.
In practice, it's just a pain.
#+begin_src
(blink-cursor-mode -1)
#+END_SRC

*** Show Keybindings
show available keybindings after you start typing
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package which-key
  :diminish which-key-mode
  :config (which-key-mode +1))
#+END_SRC

*** Open File At Point
Open file with emacsclient with cursors positioned on requested line.
Most of console-based utilities prints filename in format
'filename:linenumber'.  So you may wish to open filename in that format.
Just call:
#+begin_src
emacsclient filename:linenumber
#+END_SRC

to open 'filename' and set the cursor on line 'linenumber'.
From: [[https://github.com/bbatsov/prelude][prelude]]

#+BEGIN_SRC emacs-lisp :tangle init.el
(defadvice server-visit-files (before parse-numbers-in-lines (files proc &optional nowait) activate)
  "Open file with emacsclient with cursors positioned on requested line.
Most of console-based utilities prints filename in format
'filename:linenumber'.  So you may wish to open filename in that format.
Just call:

  emacsclient filename:linenumber

to open 'filename' and set the cursor on line 'linenumber'."
  (ad-set-arg 0
              (mapcar (lambda (fn)
                        (let ((name (car fn)))
                          (if (string-match
                               "^\\(.*?\\):\\([0-9]+\\)\\(?::\\([0-9]+\\)\\)?$"
                               name)
                              (cons
                                (match-string 1 name)
                                (cons (string-to-number (match-string 2 name))
                                      (string-to-number
                                       (or (match-string 3 name)
                                           ""))))
                            fn)))
                      files)))
#+END_SRC

*** Titles
**** Set Frame Title Format
The frame is the whole external "emacs window", not to be confused with a window within emacs which displays
a buffer. An emacs instance may have multiple frames and a frame may have multiple windows. This sets the
title of the window to the filename of the active buffer if available otherwise the buffer name.
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq frame-title-format
      '("" invocation-name " - "
        (:eval (if (buffer-file-name)
                   (abbreviate-file-name (buffer-file-name))
                 "%b"))))
 #+END_SRC

