readme.org
**** Buffer Titles
Rename buffers with the same file name to something useful
#+BEGIN_SRC emacs-lisp :tangle init.el
(when (require 'uniquify nil t)
  (setq uniquify-buffer-name-style   'forward
        uniquify-separator           "/"
        ;; rename after killing uniquified
        uniquify-after-kill-buffer-p t
        ;; ignore system buffers
        uniquify-ignore-buffers-re   "^\\*"))
#+END_SRC

*** Reload When Files Change
When underlying files change, revert buffers automatically.
#+BEGIN_SRC emacs-lisp :tangle init.el
(global-auto-revert-mode t)
#+END_SRC

*** Save Command History
Remember most recently run commands and text searches
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package savehist
  :config (savehist-mode 1))

(defvar personal-keybindings (make-sparse-keymap))
(use-package smex
  :after ido
  :bind (("M-x" . smex)
          ("M-X" . smex-major-mode-commands))
  :config (smex-initialize))
#+END_SRC

*** Splitting Windows
Prefer to split vertically rather than horizontally. Shamelessly stolen from stack overflow years ago.
#+BEGIN_SRC emacs-lisp :tangle init.el
(defun mkyle/split-window (&optional window)
  "Split window more senibly.  WINDOW."
  (let ((window (or window (selected-window))))
    (or (and (window-splittable-p window t)
             ;; Split window horizontally.
             (with-selected-window window
               (split-window-right)))
        (and (window-splittable-p window)
             ;; Split window vertically.
             (with-selected-window window
               (split-window-below)))
        (and (eq window (frame-root-window (window-frame window)))
             (not (window-minibuffer-p window))
             ;; If WINDOW is the only window on its frame and is not the
             ;; minibuffer window, try to split it horizontally disregarding
             ;; the value of `split-width-threshold'.
             (let ((split-width-threshold 0))
               (when (window-splittable-p window t)
                 (with-selected-window window
                   (split-window-right))))))))

(setq-default split-window-preferred-function #'mkyle/split-window)
#+END_SRC

*** Finding the Cursor
Show the cursor when moving after big movements in the window
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package beacon
  :diminish beacon-mode
  :config (beacon-mode +1))
#+END_SRC
*** Remove suspend-frame keybinding
This keybinding makes sense for a terminal editor but occasionally I hit it by accident while using exwm and it just destroys one's train of thought.
#+BEGIN_SRC emacs-lisp :tangle init.el
(global-unset-key (kbd "C-x C-z"))
#+END_SRC

** Navigation
*** List Buffers - IBuffer
List buffers with C-x C-b. The default emacs buffer list leaves much to be desired; IBuffer is a good alternative.
#+BEGIN_SRC emacs-lisp :tangle init.el
(global-set-key (kbd "C-x C-b") 'ibuffer)
#+END_SRC

Update list when ibuffer gets focus
#+BEGIN_SRC emacs-lisp :tangle init.el
(with-eval-after-load "ibuffer"
  (add-hook 'ibuffer-mode-hook 'ibuffer-auto-mode))
#+END_SRC

**** IBuffer Columns
Setup the buffer list columns to show more of the name
#+BEGIN_SRC emacs-lisp :tangle init.el
(with-eval-after-load "ibuffer"
  (setq ibuffer-formats
  '((mark modified read-only " "
     (name 40 40 :left :elide) " " ;; 40 40 is the column width
     (size 9 -1 :right) " "
     (mode 8 8 :left :elide) " "
     filename-and-process)
    (mark " " (name 16 -1) " " filename))))
#+END_SRC

**** IBuffer Filter Groups
Organize the list of buffers by group. Dynamic groups allow this list to be generated and for it to be extended
by other packages (like ibuffer-projectile)
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package ibuffer-dynamic-groups
  :after ibuffer
  :straight (ibuffer-dynamic-groups :type git
                                    :host github
                                    :repo "mitch-kyle/ibuffer-dynamic-groups")
  :config (progn
           (setq ibuffer-show-empty-filter-groups nil)
           (ibuffer-dynamic-groups-add
            (lambda (groups)
              (append groups
                      '(("System" (name . "^\\*.*\\*$")))))
            '((name . system-group)))
           (ibuffer-dynamic-groups t)))
#+END_SRC

*** List Options When Doing Things - Ido
Better interactive mini-buffer menus. highly recommend
See [[http://ergoemacs.org/emacs/emacs_ido_mode.html][ergomacs ido tutorial]]

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package ido
  :config
  (progn
    (setq ido-enable-prefix                      nil
          ido-enable-flex-matching               t
          ido-create-new-buffer                  'always
          ido-use-filename-at-point              'guess
          ido-max-prospects                      10
          ido-default-file-method                'selected-window
          ido-auto-merge-work-directories-length -1)
    (ido-mode +1)))

(use-package ido-completing-read+
  :after ido
  :config (ido-ubiquitous-mode +1))

;; smarter fuzzy matching for ido
(use-package flx-ido
  :after ido
  :config (progn (flx-ido-mode +1)
                 ;; disable ido faces to see flx highlights
                 (setq ido-use-faces nil)))
#+END_SRC

*** Direct Based Window Navigation - Windmove
Switch windows in the direct of the arrow keys. (s-<arrow>). (C-c <arrow>) in the terminal because modifiers on arrow keys aren't always supported
#+BEGIN_SRC emacs-lisp :tangle init.el
(windmove-default-keybindings)

(progn
  (global-set-key [s-left]  'windmove-left)
  (global-set-key [s-right] 'windmove-right)
  (global-set-key [s-up]    'windmove-up)
  (global-set-key [s-down]  'windmove-down))

(unless window-system
  (progn
    (global-set-key (kbd "C-c <left>")  'windmove-left)
    (global-set-key (kbd "C-c <right>") 'windmove-right)
    (global-set-key (kbd "C-c <up>")    'windmove-up)
    (global-set-key (kbd "C-c <down>")  'windmove-down)))
#+END_SRC

** Editing
*** Keep Directories Clean
emacs creates these annoy =.#filename= lock files in the directory of
the file being edited. When there's only one user on the system
they're mostly just a pain.
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq-default create-lockfiles nil)
#+END_SRC

Auto-save creates =#filename#= files in the directory of the file being edited;
this interferes with just about everything so let's move them to the variable
directory.
#+BEGIN_SRC emacs-lisp :tangle init.el
(with-eval-after-load "no-littering"
  (setq-default auto-save-file-name-transforms
                `((".*" ,no-littering-var-directory t))))
#+END_SRC

*** Project Management - Projectile
A set of commands for editing files as part of a project
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package projectile
  :diminish projectile-mode
  :config (progn
            (global-set-key (kbd "C-c p") projectile-command-map)
            (projectile-mode t)))
#+END_SRC

**** Projectile IBuffer Groups
Group files by project in ibuffer
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package ibuffer-projectile
  :after (:all projectile ibuffer-dynamic-groups)
  :config
  (progn
    (setq ibuffer-projectile-prefix "- ")
    (with-eval-after-load "ibuffer-dynamic-groups"
      (ibuffer-dynamic-groups-add
       (lambda (groups)
         (append (ibuffer-projectile-generate-filter-groups)
                 groups))
       '((name . projectile-groups)
         (depth . -50))))))
#+END_SRC

*** Edit Remote Files - Tramp
Tramp is useful for editing files on remote systems or for editing files as a different user such as root

Just open the remote file like:
#+BEGIN_EXAMPLE
ssh:user@example.com:/path/to/file
#+END_EXAMPLE

Or the permission protected file:
#+BEGIN_EXAMPLE
sudo:root@localhost:/path/to/file
#+END_EXAMPLE

*** Sane Basic Editing Keybindings
Make C-[x,c,v] work how you would expect in a text editor. /with-love
#+BEGIN_SRC emacs-lisp :tangle init.el
(cua-mode t)
#+END_SRC

*** Rainbow Delimiters
Give nested delimiters (=()[]{}<>=) different colours. It is more valuable than gold

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package rainbow-delimiters
  :hook ((prog-mode) . rainbow-delimiters-mode))
#+END_SRC

*** Line Numbers
Always show line numbers
#+BEGIN_SRC emacs-lisp :tangle init.el
(global-linum-mode t)
#+END_SRC

*** Scrolling
Maintain cursor position when scrolling
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq scroll-margin                   0
      scroll-conservatively           100000
      scroll-preserve-screen-position 1)
#+END_SRC

*** Tab Behaviour
Use spaces instead of tabs
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq-default indent-tabs-mode  nil
              tab-width         4
              tab-always-indent 'complete)
#+END_SRC

*** Keep Whitespace Clean
Make whitespace uniform when saving a file. So if a line contains a mix of tabs and
spaces, this will replace it with "appropriate" whitespace symbols
#+BEGIN_SRC emacs-lisp :tangle init.el
(add-hook 'before-save-hook 'whitespace-cleanup)
#+END_SRC

*** Selecting Text
When you type over marked text, it should delete the text. In every other
editor it would but with emacs we have to tell it to first
#+begin_src
(delete-selection-mode t)
#+END_SRC

*** Autocomplete Dropdown
Company is your general purpose autocomplete dropdown. enable it always
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package company
  :diminish company-mode
  :config
  (progn
    (setq company-idle-delay 0.5
          company-show-numbers t
          company-tooltip-limit 10
          company-minimum-prefix-length 2
          company-tooltip-align-annotations t
          ;; invert the navigation direction if the the completion popup-isearch-match
          ;; is displayed on top (happens near the bottom of windows)
          company-tooltip-flip-when-above t)
    (global-company-mode 1)))
#+END_SRC

*** Highlighting
**** Search Results
Highlight search results
#+BEGIN_SRC emacs-lisp :tangle init.el
(setq-default search-highlight t
              query-replace-highlight t)
#+END_SRC

**** Matching Delimiters - show-paren
Highlight matching parens.
#+BEGIN_SRC emacs-lisp :tangle init.el
(show-paren-mode t)
#+END_SRC

