readme.org
**** Rainbow Mode
Highlight strings which probably represent a colour as the colour they probably represent.
e.g red DarkGreen, #2449FC
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package rainbow-mode
  :defer t
  :commands rainbow-mode
  :diminish rainbow-mode)
#+END_SRC

**** Matching Symbols
Underline other occurrences of a symbol under the cursor
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package highlight-symbol
  :hook ((prog-mode) . highlight-symbol-mode)
  :diminish highlight-symbol-mode
  :config (set-face-attribute 'highlight-symbol-face nil
                              :background nil
                              :underline t))
#+END_SRC

*** Spell Checking - flyspell
A minor mode for spell checking. When enabled use =C-c $= to correct word.
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package flyspell
  :commands flyspell-mode
  :config
  (setq-default flyspell-issue-welcome-flag nil
                flyspell-issue-message-flag nil
                ispell-program-name         "/usr/bin/aspell"
                ispell-list-command         "list"))
#+END_SRC

*** Code Snippets - yasnippets
Auto fill common code blocks
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package yasnippet
  :bind (:map yas-minor-mode-map
         ("C-`" . yas-expand)
         ("C-/" . yas-insert-snippet))
  :commands yas-minor-mode)

(use-package yasnippet-snippets
  :after yasnippets)
#+END_SRC

** X Windows
*** Window Divider
Make the vertical window divider available but only one pixel wide
#+BEGIN_SRC emacs-lisp :tangle init.el
(when window-system
  (setq-default window-divider-default-right-width 1)
  (window-divider-mode t))
#+END_SRC

*** Transparency
I like the "glass editing window" effect. This sets it that way by default and gives a function to toggle it.
#+BEGIN_SRC emacs-lisp :tangle init.el
(when window-system
  (defun mkyle/toggle-transparency ()
    "Toggle off window transparency"
    (interactive)
    (set-frame-parameter nil 'alpha
      (if (eql (car (frame-parameter nil 'alpha))
               100)
          '(95 . 95)
        '(100 . 100))))

  (set-frame-parameter nil 'alpha '(95 . 95))

  ;; Make new frame transparent because we don't always inherit
  (add-to-list 'after-make-frame-functions
               (lambda (&rest _)
                 (set-frame-parameter nil 'alpha '(95 . 95)))))
#+END_SRC

* Language Specific Packages
Packages related to editing different file formats

** Org Mode
Org mode is used to build this document.
#+NAME: load-org
#+BEGIN_SRC emacs-lisp :tangle no
(use-package org
  :mode ("\\.org\\'" . org-mode)
  :config (progn (add-hook 'org-mode-hook 'flyspell-mode)
                 (add-hook 'org-mode-hook 'yas-minor-mode)))
#+END_SRC

Generating table of contents in org files with =:TOC:= tag
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package toc-org
  :after org
  :hook ((org-mode) . toc-org-mode))
#+END_SRC

** Emacs Lisp
Extension language for emacs. Most useful packages for elisp are included with vanilla emacs

*** Documentation
Show documentation in the minibuffer for symbol under cursor
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package eldoc
  :diminish eldoc-mode
  :hook ((emacs-lisp-mode) . eldoc-mode))
#+END_SRC

*** Autocompile
Automatically compile emacs lisp files from the user configuration directory =~/.emacs.d=.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package auto-compile
  :config
  (progn
    (setq auto-compile-display-buffer    nil
          auto-compile-mode-line-counter t)
    (auto-compile-on-load-mode +1)
    (auto-compile-on-save-mode +1)))
#+END_SRC

** Conf Files
Syntax highlighting for unix config files
#+BEGIN_SRC emacs-lisp :tangle init.el
(mapc (lambda (filename-regex)
        (add-to-list 'auto-mode-alist `(,filename-regex . conf-mode)))
      (list "\\.conf\\'"
            "\\.desktop\\'"
            "\\.service\\'"))
#+END_SRC

** Clojure
A more opinionated scheme for jvm written by Rich Hickey. Some said it wasn't possible to make a more
particular scheme; Rich disagrees.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package clojure-mode
  :mode ("\\.edn\\'" "\\.clj\\'")
  :config (add-hook 'clojure-mode-hook 'subword-mode))
#+END_SRC

*** Cider
Cider is a featureful repl for clojure development
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package cider
  :defer t
  :config (progn
            (setq nrepl-log-messages                   t
                  cider-inject-dependencies-at-jack-in t)
            (add-hook 'cider-mode-hook      'eldoc-mode)
            (add-hook 'cider-repl-mode-hook 'subword-mode)
            (add-hook 'cider-repl-mode-hook 'rainbow-delimiters-mode)

            (define-key cider-mode-map (kbd "C-c f") 'cider-find-var)

            (with-eval-after-load "ibuffer-dynamic-groups"
              (ibuffer-dynamic-groups-add
               (lambda (groups)
                 (append '(("Cider" (or (name . "^\\*nrepl-.*\\*$")
                                        (name . "^\\*cider-.*\\*$"))))
                         groups))
               '((name . cider-group)
                 (depth . -1))))))
#+END_SRC

** CMake
It's like make only less accessible to new users. you're welcome. - GNU, probably
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package cmake-mode
  :mode ("CMakeLists\\.txt\\'" "\\.cmake\\'")
  :config (add-hook 'cmake-mode-hook 'yas-minor-mode))
#+END_SRC

** JavaScript
The most fully featured language for running in the web browser and I wish I was joking.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package js2-mode
  :mode ("\\.js\\'" "\\.pac\\'")
  :interpreter "node")

(use-package json-mode
  :mode "\\.json\\'")
#+END_SRC

** Scheme
Like clojure but old. GNU's trying to bring it back with GNU/Guile. power to them.

#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package scheme
  :mode ("\\.scm\\'" . scheme-mode))
#+END_SRC

You really need to have a repl open when editing scheme files. Geiser is a nice one for emacs. invoke with =geiser=
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package geiser
  :defer t
  :config (setq geiser-mode-start-repl-p t))
#+END_SRC

** Groovy
Don't get much use out of groovy syntax highlighting but it's useful for editing Jenkinsfiles
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package groovy-mode
  :mode ("\\.groovy\\'" "JenkinsFile\\'"))
#+END_SRC

** Docker
Dockerfile syntax highlighting
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package dockerfile-mode
  :mode "Dockerfile\\'")
#+END_SRC

** YAML
Seriously if you have the choice, use json or even edn. If you don't, here's some syntax highlighting for yaml.
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package yaml-mode
  :mode ("\\.yaml\\'" "\\.yml\\'"))
#+END_SRC

** Markdown
Like org but not as cool
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package markdown-mode
  :mode ("\\.md\\'" "\\.markdown\\'")
  :config (progn (add-hook 'markdown-mode-hook 'flyspell-mode)
                 (add-hook 'markdown-mode-hook 'yas-minor-mode)))
#+END_SRC

** Lua
Because 'X' won't mod itself
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package lua-mode
  :mode "\\.lua\\'")
#+END_SRC

** Zsh
Interpret the *many* zsh configuration scripts as zsh and recognize the =.zsh= file extension
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package sh-script
  :ensure t
  :config
  (let ((zsh-files '("zlogin" "zlogin" "zlogout" "zpreztorc"
                     "zprofile" "zshenv" "zshrc" ".zsh")))
    (add-to-list 'auto-mode-alist '("\\.zsh\\'" . shell-script-mode))
    (mapc (lambda (file)
            (add-to-list 'auto-mode-alist
                         `(,(format "\\%s\\'" file) . sh-mode)))
          zsh-files)
    (add-hook 'sh-mode-hook
              (lambda ()
                (when
                  (and buffer-file-name
                       (member (file-name-nondirectory buffer-file-name)
                               zsh-files))
                  (sh-set-shell "zsh"))))))
#+END_SRC

** Terraform
Because why use something everyone's familiar with when you can create your own domain specific language?
I'm just sour because I think one should use scheme should to configure everything non-trivial. :-)
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package terraform-mode
  :mode ("\\.tf\\'" "\\.tvars\\'"))
#+END_SRC

* Software Distribution Specific Packages
Packages specific to different software distributions or systems.

** Arch
Search and fetch arch recipes from the AUR.
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package aurel
  :when (executable-find "makepkg")
  :defer t)
#+END_SRC

** Guix
A build system / package manager / os definition system / waffle-iron all written in guile scheme.
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package guix
  :when (executable-find "guix")
  :commands (guix)
  :bind (("s-x p" . guix)))
#+END_SRC

* Miscellaneous Packages
** Git
A version control tool created by Linus Torvalds

*** Magit
Magit is nice front-end to git. C-c m to open magit-status popup
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package magit
  :defer t
  :bind (("C-x g" . magit-status)))
#+END_SRC

*** Git file modes
Modes for editing git files e.g =.gitignore=
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package git-modes
  :defer t)
#+END_SRC

