readme.org
*** Mergetool
To use emacs as a git mergetool, you need to add something like the following to =~/.gitconfig=
#+BEGIN_EXAMPLE
[mergetool.ediff]
  cmd = emacsclient --eval \"(ediff-merge-files-with-ancestor \\\"$LOCAL\\\" \\\"$REMOTE\\\" \\\"$BASE\\\" nil \\\"$MERGED\\\")\"
[merge]
  tool = ediff
#+END_EXAMPLE

Cleanup ediff buffers and restore window configuration when finished.
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package ediff
  :defer t
  :config
  (progn
    (defun mkyle/ediff-write-merge-buffer ()
      (let ((file ediff-merge-store-file))
        (set-buffer ediff-buffer-C)
        (write-region (point-min) (point-max) file)
        (message "Merge buffer saved in: %s" file)
        (set-buffer-modified-p nil)
        (sit-for 1)))
    (add-hook 'ediff-quit-merge-hook 'mkyle/ediff-write-merge-buffer)

    (defvar mkyle/ediff-last-windows nil)

    (defun mkyle/store-pre-ediff-winconfig ()
      (setq mkyle/ediff-last-windows (current-window-configuration)))
    (add-hook 'ediff-before-setup-hook 'mkyle/store-pre-ediff-winconfig)

    (defun mkyle/restore-pre-ediff-winconfig ()
      (dolist (buf (list ediff-buffer-A
                         ediff-buffer-B
                         ediff-buffer-C
                         "*Ediff Control Panel*"
                         "*ediff-errors*"
                         "*ediff-diff*"
                         "*Ediff Registry*"
                         "*ediff-fine-diff*"))

        (set-window-configuration mkyle/ediff-last-windows)
        (condition-case nil
            (let ((buf (get-buffer buf)))
              (when buf (kill-buffer buf)))
          (error nil))))
    (add-hook 'ediff-quit-hook 'mkyle/restore-pre-ediff-winconfig)

    (setq-default ediff-keep-variants nil)

    ;; Don't start a new frame
    (setq-default ediff-window-setup-function 'ediff-setup-windows-plain)))
#+END_SRC

** Restclient
make http requests with =C-c C-v=

See [[https://github.com/pashky/restclient.el][restclient github]] for user guide
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package restclient
  :mode ("\\.rest\\'" . restclient-mode))
#+END_SRC

** IRC
Internet relay chat appliance for emacs. Tune erc to use utf-8, truncate long buffers,
enable logging and other things.
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package erc
  :defer t
  :commands (erc)
  :config
  (progn
    (setq erc-query-display 'buffer
          erc-interpret-mirc-color t
          erc-server-coding-system '(utf-8 . utf-8)
          erc-save-buffer-on-part t
          erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE"
                                    "324" "329" "332" "333" "353" "477"))

    (erc-truncate-mode +1)
    (erc-track-mode t)

    (when (require 'erc-log nil t)
      (unless (file-exists-p erc-log-channels-directory)
        (mkdir erc-log-channels-directory t)))

    (when (require 'erc-spelling nil t)
      (erc-spelling-mode 1))))
#+END_SRC

** Persistent Scratch
Save the scratch in case I write something down that shouldn't be in the scratch buffer
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package persistent-scratch
  :commands (persistent-scratch-restore
             persistent-scratch-autosave-mode
             persistent-scratch-mode)
  :diminish persistent-scratch-mode
  :config
  (progn
    (persistent-scratch-setup-default)
    (persistent-scratch-restore)))

(defun mkyle/scratch ()
  "Get or create the scratch buffer"
  (interactive)
  (unless (get-buffer "*scratch*")
    (persistent-scratch-restore))
  (switch-to-buffer (get-buffer "*scratch*"))
  (lisp-interaction-mode)
  (persistent-scratch-mode +1)
  (persistent-scratch-autosave-mode +1))

(global-set-key (kbd "s-x s") 'mkyle/scratch)
#+END_SRC

** Terminal
vterm is an integrated terminal emulator using modules.
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package vterm
  :commands (vterm)
  :init (setq vterm-always-compile-module t
              vterm-buffer-name-string    "*vterm* %s")
  :config
  (progn
    (define-key vterm-copy-mode-map (kbd "C-c C-c") 'copy-region-as-kill)
    ;; even with this hack it doesn't handle cua-mode very well
    (add-hook 'vterm-mode-hook (lambda ()
                                 (linum-mode -1)
                                 (make-local-variable 'cua-enable-cua-keys)
                                 (setq cua-enable-cua-keys nil)
                                 (local-set-key (kbd "C-v") 'vterm-yank)
                                 (local-set-key (kbd "C-z") 'vterm-undo)))

    (with-eval-after-load "ibuffer-dynamic-groups"
      (ibuffer-dynamic-groups-add (lambda (groups)
                                    (append '(("Terminals" (mode . vterm-mode)))
                                            groups))
                                 '((name . vterm-group)
                                   (depth . -9))))))

(defun mkyle/vterm-execute (command)
  "Start a vterm session with the given command"
   (interactive (list (read-shell-command "$ ")))
   (let ((vterm-shell command))
     (vterm)))

(global-set-key (kbd "s-!") #'mkyle/vterm-execute)
(global-set-key (kbd "s-`") #'mkyle/run-sh-async)
#+END_SRC

*** vtermux
#+begin_src emacs-lisp :tangle init.el
(use-package vtermux
  :straight (vtermux :type   git
                     :host   github
                     :repo   "mitch-kyle/vtermux"
                     :branch "main")
  :after vterm
  :commands (vtermux vtermux-mode)
  :bind (:map global-map
         ("s-<return>" . vtermux))
  :config
  (progn (require 'vtermux-spaceline)
         (vtermux-spaceline-enable)))
#+end_src

** External Applications
#+BEGIN_SRC emacs-lisp :tangle init.el
(defun mkyle/run-sh-async (&optional command)
  "Interactive prompt to run a shell command in a child process which
may or may not spawn an x window"
  (interactive (list (read-shell-command "$ ")))
  (when command
    (start-process-shell-command "" nil command)))
#+END_SRC

*** Persistent Buffers
Used for tracking the vterm buffers running the volume and music apps

#+BEGIN_SRC emacs-lisp :tangle init.el
(defvar mkyle/labeled-buffers (make-hash-table :weakness 'value))

(defun mkyle/labeled-buffer (label create-new)
  "switch to labeled buffer if buffer does not exist create it by
invoking `create-new'."
  (let ((buf (gethash label mkyle/labeled-buffers)))
    (if (and buf (buffer-live-p buf))
        (switch-to-buffer buf)
      (funcall create-new)
      (puthash label (current-buffer) mkyle/labeled-buffers)
      nil)))
#+END_SRC

*** Volume
#+BEGIN_SRC emacs-lisp :tangle init.el
(defun mkyle/volume ()
  (interactive)
   (mkyle/labeled-buffer 'mkyle/volume
                        (lambda ()
                          (let ((vterm-shell (if (executable-find "pulsemixer")
                                                 "pulsemixer"
                                               "alsamixer"))
                                (vterm-buffer-name-string "*volume* - %s"))
                            (vterm)))))

(defun mkyle/volume-down ()
  (interactive)
  (start-process-shell-command "" nil "amixer set Master 5%-"))

(defun mkyle/volume-up ()
  (interactive)
  (start-process-shell-command "" nil "amixer set Master 5%+"))

(defun mkyle/volume-mute ()
  (interactive)
  (start-process-shell-command "" nil "amixer set Master toggle"))

(defun mkyle/volume-mute-mic ()
  (interactive)
  (start-process-shell-command "" nil "amixer set Mic toggle"))

(global-set-key (kbd "s-x v") 'mkyle/volume)
#+END_SRC

*** Music
#+BEGIN_SRC emacs-lisp :tangle init.el
(defun mkyle/music ()
  (interactive)
  (mkyle/labeled-buffer 'mkyle/music
                        (lambda ()
                          (let ((vterm-shell "ncmpcpp -s playlist -S visualizer")
                                (vterm-buffer-name-string "*music* - %s"))
                            (vterm)))))

(defun mkyle/music-next ()
  (interactive)
  (start-process-shell-command "" nil "mpc next"))

(defun mkyle/music-prev ()
  (interactive)
  (start-process-shell-command "" nil "mpc prev"))

(defun mkyle/music-toggle ()
  (interactive)
  (start-process-shell-command "" nil "mpc toggle"))

(global-set-key (kbd "s-x m") 'mkyle/music)
#+END_SRC

** Window Manager - EXWM
"You did it. You're free" - Janet Carr, sarcastically, when I told her I started using emacs as a window
manager.
See: [[./window-manager.org][window-manager.org]]
#+BEGIN_SRC emacs-lisp :tangle init.el
(use-package exwm
  ;; TODO find test for emacs on root window to put here
  :if window-system
  :after no-littering
  :commands (exwm-init exwm-enable)
  :defer t
  :config
  (require 'window-manager
           (expand-file-name "window-manager.el"
                             user-emacs-directory)
            t))
#+END_SRC

* Footer
Add a marker so we know where the file ends.
#+BEGIN_SRC emacs-lisp :tangle init.el
;; init.el ends here
#+END_SRC
* Tasks
** TODO Recompile on save

# readme.org ends here
